/***************************************************************************
 *  2021.07.19 made by take ymko                                           *
 *  UXBooster Example javascript Library                                           *
 ***************************************************************************/

/***************************************************************************
 * 필수 작성 요소
 ***************************************************************************/
// 중복 방지를 위해 호출
var example = createNS("example");

// 이름 명시 명시 (load 되었는지 여부 확인할때 사용)
example.name = "example";

/****************************************************************************************
 * 각 업무단에서 사용할 script 작성 Start
 *
 * js에 함수 작성 --> example.함수아이디         
 * 	ex: example.fnTest = function(...){...};
 *
 * 업무단 함수 사용 --> example.함수(인자)  
 * 	ex: example.fnTest(this, "test");
 *****************************************************************************************/

/**
 * 업무 라이브러리 테스트
 * @param {object}	pThis	폼
 * @param {string}    	sText	텍스트 
 * @return {boolean} 	성공 여부
 */
example.fnTest = function(pThis, sText)
{
    take.alert(pThis, "Info", sText);
}

/***************************************************************************
 * 각 업무별 script 작성 End
 ***************************************************************************/
